Backend/docs/diagramas/login/proceso de software.puml
@startuml Diagrama_Proceso_Autenticacion

|#E3F2FD|Usuario|
start
repeat
  :Ingresar número de cédula;
  
  |#E8F5E9|Sistema|
backward:Mostrar error de validación de cédula;
repeat while (¿Cédula válida?) is (no) not (sí)

:Buscar cédula en colección de Administradores;

if (¿Es Administrador?) then (sí)
  :Presentar opciones de ingreso (Encuesta / Panel Admin);
  
  |#E3F2FD|Usuario|
  :Seleccionar modo de acceso;
  
  if (¿Opción seleccionada?) then (Panel Admin)
    |#E3F2FD|Usuario|
    repeat
      :Ingresar contraseña;
      
      |#E8F5E9|Sistema|
    backward:Mostrar mensaje de error;
    repeat while (¿Contraseña correcta?) is (no) not (sí)
    
    :Autenticar y otorgar permisos de administrador;
    |#E3F2FD|Usuario|
    :Ingresar al Panel de Administración;
    stop
  else (Encuesta)
    |#E8F5E9|Sistema|
    :Redirigir a la encuesta docente;
  endif
else (no)
  |#E8F5E9|Sistema|
  :Permitir acceso directo a la encuesta;
endif

|#E3F2FD|Usuario|
:Acceder a la Encuesta Docente;
stop
@enduml
